// Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
// Например, даны 2 матрицы:
// 2 4 | 3 4
// 3 2 | 3 3
// Результирующая матрица будет:
// 18 20
// 15 18

int[,] A = {
    {2, 4},
    {3, 2}
};

int[,] B = {
    {3, 4},
    {3, 3}
};

int[,] r = new int[3,3];
 
 for (int i = 0; i < A.GetLength(0); i++)
            {
                for (int j = 0; j < B.GetLength(1); j++)
                {
                    for (int k = 0; k < B.GetLength(0); k++)
                    {
                        r[i,j] += A[i,k] * B[k,j];
                    }
                    Console.Write($"{r[i,j]} ");
                }
                Console.WriteLine();
            }
